ruby/N.org
#+TITLE:     N
#+AUTHOR:    Hao Ruan
#+EMAIL:     haoru@cisco.com
#+LANGUAGE:  en
#+LINK_HOME: http://www.github.com/ruanhao
#+OPTIONS:   h:6 html-postamble:nil html-preamble:t tex:t f:t ^:nil
#+STARTUP:   showall
#+TOC:       headlines 3
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
 #+HTML: <div class="outline-2" id="meta">
| Author   | {{{author}}} ({{{email}}})    |
| Date     | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: <a href="#bottom">⇩</a>
#+HTML: <a id="top"/>
#+HTML: </div>


* [[https://wordsinasentence.com/naivete-in-a-sentence/][Naiveté]]

  =the state of being innocent=

  - Danielle’s naiveté allowed her to foolishly believe the stranger would repay the money she loaned him.
  - If it were not for the naiveté of some senior citizens, many crooks would not earn a living.
  - The sneaky porn producer preyed on the naiveté of young girls by promising them fame for favors.
  - Smugglers rely on the naiveté of inexperienced travellers to get their goods through customs.



* [[https://wordsinasentence.com/nebulous-in-a-sentence/][Nebulous]]

  =Unclear, vague; not clearly defined=

  - It was not difficult to realize her answer to the question was nebulous.
  - Scientists are not certain why nebulous gas balls rotate around the planet.
  - After the accident, his memories were quite nebulous.
  - Beauty is a nebulous term until it is defined by the beholder.
  - While the driving teacher thought his instructions were clear, the students found them to be nebulous.
  - Before the man drifted into unconsciousness, he voiced nebulous words about a hidden treasure.
  - In the Bible, there are many quotes about nebulous figures coming down from heaven.



* [[https://wordsinasentence.com/negligent-in-a-sentence/][Negligent]]

  =careless; irresponsible=

  - I felt negligent for leaving Jean’s toddler alone in the car.
  - Rick failed to keep an eye on his young daughter, and the jury found him negligent.
  - The negligent driver swerved at the last second, avoiding a collision.
  - By failing to lock the door, Calvin was deemed negligent.



* [[https://wordsinasentence.com/negligible-in-a-sentence/][Negligible]]

  =too small to be of importance=

  - Since the price difference between the generic item and the brand item is negligible, I will buy the brand product.
  - Because Jill lost only a negligible amount of weight using the diet drug, she sent the product back for a refund.
  - While it appeared we were stuck in travel for hours, the time was negligible and only delayed our arrival by fifteen minutes.
  - What are the odds the rip in my stocking will remain negligible and go unnoticed by my coworkers?
  - Since Frank’s share of the company is negligible, he receives very little return on his investment.
  - Danielle cannot expect to pass her chemistry test if she only spends a negligible amount of time studying.
  - Because Jake’s knowledge of French is negligible, he will utilize the services of a translator during his business trip to Paris.



* [[https://wordsinasentence.com/nocturnal-in-a-sentence/][Nocturnal]]

  =taking place at night=

  - Bats are nocturnal creatures because they tend to be more active during the night hours.
  - Because I sleep all night, I do not consider myself to be a nocturnal person.
  - Jim is a nocturnal hunter who prefers to do his hunting in the evening.
  - Whenever Kate is awakened by a noise at night, she has to remember the presence of her nocturnal cat.
  - The festival’s nocturnal activities will begin at sunset.
  - Because Eric and Grace are having a nocturnal wedding, they will exchange vows on Saturday evening at nine o’clock.
  - The soldiers wear night-vision goggles during nocturnal missions.



* [[https://wordsinasentence.com/noisome-in-a-sentence/][Noisome]]

  =disgusting in smell=

  - The dog’s noisome odor is making me physically ill.
  - As soon as the police arrived on the scene, they became aware of the noisome odor of a gas leak.
  - Janice refuses to ride in her boyfriend’s car until he cleans it with something that will eliminate the noisome smell.
  - When we walked into the restaurant, we were overwhelmed by the noisome odor of old fish.
  - The student’s noisome prank was so offensive in odor that the entire school had to be evacuated.
  - As soon as I opened the refrigerator, the noisome scent of bad meat hit my nose.
  - The homeless man has a noisome odor because he has not showered in months.



* [[https://wordsinasentence.com/nomadic-in-a-sentence/][Nomadic]]

  =having the life of a drifter=

  - Because my husband is a long distance truck driver, his days are very nomadic.
  - The nomadic tribe moved their camp several times a year.
  - When I worked on the food truck, I felt I had a nomadic existence because the truck was constantly moving.
  - John is a nomadic blues singer who goes from bar to bar in hopes of being discovered by a music producer.
  - Since Jason does not like to travel, he would not enjoy the nomadic lifestyle of a circus performer.
  - The nomadic con artist moves often so the authorities will not catch him.
  - As a substitute teacher in a large school district, Helen has a nomadic schedule that puts her at a different school every day.



