ruby/N.html
<!DOCTYPE html>
<html>
<head>
<title>N</title>
<!-- 2018-06-06 Wed 21:49 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">N</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Naiveté</a></li>
<li><a href="#sec-2">2. Nebulous</a></li>
<li><a href="#sec-3">3. Negligent</a></li>
<li><a href="#sec-4">4. Negligible</a></li>
<li><a href="#sec-5">5. Nocturnal</a></li>
<li><a href="#sec-6">6. Noisome</a></li>
<li><a href="#sec-7">7. Nomadic</a></li>
<li><a href="#sec-8">8. Noncommittal</a></li>
<li><a href="#sec-9">9. Nonconformist</a></li>
<li><a href="#sec-10">10. Nonentity</a></li>
<li><a href="#sec-11">11. Nonplussed</a></li>
<li><a href="#sec-12">12. Nonsensical</a></li>
<li><a href="#sec-13">13. Notoriety</a></li>
<li><a href="#sec-14">14. Nadir</a></li>
<li><a href="#sec-15">15. Nascent</a></li>
<li><a href="#sec-16">16. Natal</a></li>
<li><a href="#sec-17">17. Necessitous</a></li>
<li><a href="#sec-18">18. Nefarious</a></li>
<li><a href="#sec-19">19. Nemesis</a></li>
<li><a href="#sec-20">20. Neologism</a></li>
<li><a href="#sec-21">21. Neophyte</a></li>
<li><a href="#sec-22">22. Nettle</a></li>
<li><a href="#sec-23">23. Niggle</a></li>
<li><a href="#sec-24">24. Nimble</a></li>
<li><a href="#sec-25">25. Nominal</a></li>
<li><a href="#sec-26">26. Nostrum</a></li>
<li><a href="#sec-27">27. Noxious</a></li>
<li><a href="#sec-28">28. Nugatory</a></li>
<li><a href="#sec-29">29. Numinous</a></li>
<li><a href="#sec-30">30. Numismatist</a></li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Naiveté</a></li>
<li><a href="#sec-2">2. Nebulous</a></li>
<li><a href="#sec-3">3. Negligent</a></li>
<li><a href="#sec-4">4. Negligible</a></li>
<li><a href="#sec-5">5. Nocturnal</a></li>
<li><a href="#sec-6">6. Noisome</a></li>
<li><a href="#sec-7">7. Nomadic</a></li>
<li><a href="#sec-8">8. Noncommittal</a></li>
<li><a href="#sec-9">9. Nonconformist</a></li>
<li><a href="#sec-10">10. Nonentity</a></li>
<li><a href="#sec-11">11. Nonplussed</a></li>
<li><a href="#sec-12">12. Nonsensical</a></li>
<li><a href="#sec-13">13. Notoriety</a></li>
<li><a href="#sec-14">14. Nadir</a></li>
<li><a href="#sec-15">15. Nascent</a></li>
<li><a href="#sec-16">16. Natal</a></li>
<li><a href="#sec-17">17. Necessitous</a></li>
<li><a href="#sec-18">18. Nefarious</a></li>
<li><a href="#sec-19">19. Nemesis</a></li>
<li><a href="#sec-20">20. Neologism</a></li>
<li><a href="#sec-21">21. Neophyte</a></li>
<li><a href="#sec-22">22. Nettle</a></li>
<li><a href="#sec-23">23. Niggle</a></li>
<li><a href="#sec-24">24. Nimble</a></li>
<li><a href="#sec-25">25. Nominal</a></li>
<li><a href="#sec-26">26. Nostrum</a></li>
<li><a href="#sec-27">27. Noxious</a></li>
<li><a href="#sec-28">28. Nugatory</a></li>
<li><a href="#sec-29">29. Numinous</a></li>
<li><a href="#sec-30">30. Numismatist</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-06-06 21:49:58</td>
</tr>
</tbody>
</table>
<a href="#bottom">⇩</a>
<a id="top"/>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="https://wordsinasentence.com/naivete-in-a-sentence/">Naiveté</a></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>the state of being innocent</code>
</p>

<ul class="org-ul">
<li>Danielle’s naiveté allowed her to foolishly believe the stranger would repay the money she loaned him.
</li>
<li>If it were not for the naiveté of some senior citizens, many crooks would not earn a living.
</li>
<li>The sneaky porn producer preyed on the naiveté of young girls by promising them fame for favors.
</li>
<li>Smugglers rely on the naiveté of inexperienced travellers to get their goods through customs.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <a href="https://wordsinasentence.com/nebulous-in-a-sentence/">Nebulous</a></h2>
<div class="outline-text-2" id="text-2">
<p>
<code>Unclear, vague; not clearly defined</code>
</p>

<ul class="org-ul">
<li>It was not difficult to realize her answer to the question was nebulous.
</li>
<li>Scientists are not certain why nebulous gas balls rotate around the planet.
</li>
<li>After the accident, his memories were quite nebulous.
</li>
<li>Beauty is a nebulous term until it is defined by the beholder.
</li>
<li>While the driving teacher thought his instructions were clear, the students found them to be nebulous.
</li>
<li>Before the man drifted into unconsciousness, he voiced nebulous words about a hidden treasure.
</li>
<li>In the Bible, there are many quotes about nebulous figures coming down from heaven.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <a href="https://wordsinasentence.com/negligent-in-a-sentence/">Negligent</a></h2>
<div class="outline-text-2" id="text-3">
<p>
<code>careless; irresponsible</code>
</p>

<ul class="org-ul">
<li>I felt negligent for leaving Jean’s toddler alone in the car.
</li>
<li>Rick failed to keep an eye on his young daughter, and the jury found him negligent.
</li>
<li>The negligent driver swerved at the last second, avoiding a collision.
</li>
<li>By failing to lock the door, Calvin was deemed negligent.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <a href="https://wordsinasentence.com/negligible-in-a-sentence/">Negligible</a></h2>
<div class="outline-text-2" id="text-4">
<p>
<code>too small to be of importance</code>
</p>

<ul class="org-ul">
<li>Since the price difference between the generic item and the brand item is negligible, I will buy the brand product.
</li>
<li>Because Jill lost only a negligible amount of weight using the diet drug, she sent the product back for a refund.
</li>
<li>While it appeared we were stuck in travel for hours, the time was negligible and only delayed our arrival by fifteen minutes.
</li>
<li>What are the odds the rip in my stocking will remain negligible and go unnoticed by my coworkers?
</li>
<li>Since Frank’s share of the company is negligible, he receives very little return on his investment.
</li>
<li>Danielle cannot expect to pass her chemistry test if she only spends a negligible amount of time studying.
</li>
<li>Because Jake’s knowledge of French is negligible, he will utilize the services of a translator during his business trip to Paris.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <a href="https://wordsinasentence.com/nocturnal-in-a-sentence/">Nocturnal</a></h2>
<div class="outline-text-2" id="text-5">
<p>
<code>taking place at night</code>
</p>

<ul class="org-ul">
<li>Bats are nocturnal creatures because they tend to be more active during the night hours.
</li>
<li>Because I sleep all night, I do not consider myself to be a nocturnal person.
</li>
<li>Jim is a nocturnal hunter who prefers to do his hunting in the evening.
</li>
<li>Whenever Kate is awakened by a noise at night, she has to remember the presence of her nocturnal cat.
</li>
<li>The festival’s nocturnal activities will begin at sunset.
</li>
<li>Because Eric and Grace are having a nocturnal wedding, they will exchange vows on Saturday evening at nine o’clock.
</li>
<li>The soldiers wear night-vision goggles during nocturnal missions.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <a href="https://wordsinasentence.com/noisome-in-a-sentence/">Noisome</a></h2>
<div class="outline-text-2" id="text-6">
<p>
<code>disgusting in smell</code>
</p>

<ul class="org-ul">
<li>The dog’s noisome odor is making me physically ill.
</li>
<li>As soon as the police arrived on the scene, they became aware of the noisome odor of a gas leak.
</li>
<li>Janice refuses to ride in her boyfriend’s car until he cleans it with something that will eliminate the noisome smell.
</li>
<li>When we walked into the restaurant, we were overwhelmed by the noisome odor of old fish.
</li>
<li>The student’s noisome prank was so offensive in odor that the entire school had to be evacuated.
</li>
<li>As soon as I opened the refrigerator, the noisome scent of bad meat hit my nose.
</li>
<li>The homeless man has a noisome odor because he has not showered in months.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <a href="https://wordsinasentence.com/nomadic-in-a-sentence/">Nomadic</a></h2>
<div class="outline-text-2" id="text-7">
<p>
<code>having the life of a drifter</code>
</p>

<ul class="org-ul">
<li>Because my husband is a long distance truck driver, his days are very nomadic.
</li>
<li>The nomadic tribe moved their camp several times a year.
</li>
<li>When I worked on the food truck, I felt I had a nomadic existence because the truck was constantly moving.
</li>
<li>John is a nomadic blues singer who goes from bar to bar in hopes of being discovered by a music producer.
</li>
<li>Since Jason does not like to travel, he would not enjoy the nomadic lifestyle of a circus performer.
</li>
<li>The nomadic con artist moves often so the authorities will not catch him.
</li>
<li>As a substitute teacher in a large school district, Helen has a nomadic schedule that puts her at a different school every day.
</li>
</ul>
</div>
</div>
