ruby/N.org
* [[https://wordsinasentence.com/necessitous-in-a-sentence/][Necessitous]]

  =deprived and poverty-stricken=

  - The necessitous circumstances surrounding the flood victims became evidence when we saw all of the destruction.
  - Walking down the street, the necessitous puppy’s tongue hung low and his bones were showing through his skin.
  - Appreciation was shown from the necessitous man when shelter and food was made available to him.
  - Since the mother could not afford formula, her necessitous baby was growing thinner and thinner.



* [[https://wordsinasentence.com/nefarious-in-a-sentence/][Nefarious]]

  =very evil and wicked=

  - How nefarious of you to fling dog crap on my car!
  - The nefarious September 11th attacks did not weaken America.
  - One man employed his nefarious scheme to hack into people's computers and steal bank account information.
  - We originally thought that John was going to pull nefarious April Fool's Day pranks—but surprisingly, nothing bad happened.
  - To call that handicapped woman names is not only mean, but it is nefarious.
  - As vile as robbers are, no criminal is more nefarious than a killer.
  - Nefarious best describes The Grinch.



* [[https://wordsinasentence.com/nemesis-in-a-sentence/][Nemesis]]

  =an enemy who is constantly causing problems=

  - Kara was not happy when her nemesis won the contest.
  - As soon as Kurt saw his nemesis, he became enraged.
  - In the film, the superhero vowed to catch his nemesis before he *wrecked havoc* on the planet.
  - My nemesis was determined to ruin my chance for promotion at work.



* [[https://wordsinasentence.com/neologism-in-a-sentence/][Neologism]]

  =a new term or phrase recently added to a person or group’s vocabulary=

  - The neologism became so popular it was added to most dictionaries.
  - As the teacher listened to the students chatting among themselves, she was confused by a neologism she heard repeatedly.
  - The neologism was widely spoken after a rapper mentioned it in a hit song.
  - After a number of months, the neologism turned into a commonly used phrase.



* [[https://wordsinasentence.com/neophyte-in-a-sentence/][Neophyte]]

  =someone who is just learning to do something=

  - Because I have very little computer experience, I am a neophyte when it comes to working with most software programs.
  - Since this is my daughter’s first swim lesson, she is definitely a neophyte in the sport.
  - Because Jack had no experience with the financial markets, everyone on the trading team considered him to be a neophyte.
  - Even the best golfer in the world was once a neophyte at the sport of golf.
  - One could easily recognize the neophyte fisherman by all of the mistakes he was making.
  - Although Alan was not a neophyte skier, there was still much he needed to learn.
  - All neophyte swimmers will work on their techniques in the shallow end of the pool.



* [[https://wordsinasentence.com/nettle-in-a-sentence/][Nettle]]

  =to cause someone to become annoyed or angry=

  - My brother will often nettle me by reading my diary.
  - If you nettle a bee, you should be prepared to run.
  - My employee’s habit of coming in to work late is starting to nettle me.
  - Although Elaine tried to nettle me by describing her great date with my ex-boyfriend, I did not let her comments bother me.



* [[https://wordsinasentence.com/niggle-in-a-sentence/][Niggle]]

  =to cause minor but continuous irritation or anxiety=

  - Something decided to niggle at me for the duration of the day, but even though it continued to bother me I couldn’t remember what it was.
  - I had an ant bite that continued to niggle me throughout the day, but thankfully it was nothing more than a minor irritant.
  - The high-pitched voice of the teacher never fails to niggle me, but I always tell myself that it could be worse.
  - Something that is small and agitating will niggle you, but unless it really hurts you probably will be able to more or less ignore it.




* [[https://wordsinasentence.com/nimble-in-a-sentence/][Nimble]]

  =quick in action or comprehension=

  - The overweight police officer could not catch the nimble suspect.
  - Even though Grandma Helen is in her nineties, she still has the nimble mind of a young woman.
  - The nimble hamster enjoyed running on his wheel.
  - Because Amy is not nimble in math, she often goes to school early to get extra help from the teacher.



* [[https://wordsinasentence.com/nominal-in-a-sentence/][Nominal]]

  =incredibly small=

  - The court gave me a nominal award that did not cover the cost of my car repairs.
  - Despite his immense wealth, Frank is a selfish man who gives a nominal amount to charities each year.
  - Jim did not get a lot of job applicants because he offered only a nominal salary to his employees.
  - Fortunately, I have a credit card with only a nominal interest rate.
  - There is a nominal fee added to the ticket price of all 3D movies.
  - With my coupons, my groceries cost me a nominal amount this week.
  - I need only a nominal amount of gasoline to start my lawnmower.


* [[https://wordsinasentence.com/nostrum-in-a-sentence/][Nostrum]]

  =a plan or remedy that is unlikely to work=

  - Although my sister is not a doctor, she thinks she can cure any illness and is quick to suggest a nostrum to her friends.
  - Marie wanted to lose weight so badly she bought the diet nostrum even after reading the drug’s bad reviews.
  - To get rid of an *unsightly* *rash*, Phil was even willing to try a nostrum recommended by his crazy uncle.
  - Does garlic actually cure colds or is this remedy simply another nostrum?



