ruby/N.html



<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> <a href="https://wordsinasentence.com/necessitous-in-a-sentence/">Necessitous</a></h2>
<div class="outline-text-2" id="text-17">
<p>
<code>deprived and poverty-stricken</code>
</p>

<ul class="org-ul">
<li>The necessitous circumstances surrounding the flood victims became evidence when we saw all of the destruction.
</li>
<li>Walking down the street, the necessitous puppy’s tongue hung low and his bones were showing through his skin.
</li>
<li>Appreciation was shown from the necessitous man when shelter and food was made available to him.
</li>
<li>Since the mother could not afford formula, her necessitous baby was growing thinner and thinner.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> <a href="https://wordsinasentence.com/nefarious-in-a-sentence/">Nefarious</a></h2>
<div class="outline-text-2" id="text-18">
<p>
<code>very evil and wicked</code>
</p>

<ul class="org-ul">
<li>How nefarious of you to fling dog crap on my car!
</li>
<li>The nefarious September 11th attacks did not weaken America.
</li>
<li>One man employed his nefarious scheme to hack into people's computers and steal bank account information.
</li>
<li>We originally thought that John was going to pull nefarious April Fool's Day pranks—but surprisingly, nothing bad happened.
</li>
<li>To call that handicapped woman names is not only mean, but it is nefarious.
</li>
<li>As vile as robbers are, no criminal is more nefarious than a killer.
</li>
<li>Nefarious best describes The Grinch.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> <a href="https://wordsinasentence.com/nemesis-in-a-sentence/">Nemesis</a></h2>
<div class="outline-text-2" id="text-19">
<p>
<code>an enemy who is constantly causing problems</code>
</p>

<ul class="org-ul">
<li>Kara was not happy when her nemesis won the contest.
</li>
<li>As soon as Kurt saw his nemesis, he became enraged.
</li>
<li>In the film, the superhero vowed to catch his nemesis before he <b>wrecked havoc</b> on the planet.
</li>
<li>My nemesis was determined to ruin my chance for promotion at work.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> <a href="https://wordsinasentence.com/neologism-in-a-sentence/">Neologism</a></h2>
<div class="outline-text-2" id="text-20">
<p>
<code>a new term or phrase recently added to a person or group’s vocabulary</code>
</p>

<ul class="org-ul">
<li>The neologism became so popular it was added to most dictionaries.
</li>
<li>As the teacher listened to the students chatting among themselves, she was confused by a neologism she heard repeatedly.
</li>
<li>The neologism was widely spoken after a rapper mentioned it in a hit song.
</li>
<li>After a number of months, the neologism turned into a commonly used phrase.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> <a href="https://wordsinasentence.com/neophyte-in-a-sentence/">Neophyte</a></h2>
<div class="outline-text-2" id="text-21">
<p>
<code>someone who is just learning to do something</code>
</p>

<ul class="org-ul">
<li>Because I have very little computer experience, I am a neophyte when it comes to working with most software programs.
</li>
<li>Since this is my daughter’s first swim lesson, she is definitely a neophyte in the sport.
</li>
<li>Because Jack had no experience with the financial markets, everyone on the trading team considered him to be a neophyte.
</li>
<li>Even the best golfer in the world was once a neophyte at the sport of golf.
</li>
<li>One could easily recognize the neophyte fisherman by all of the mistakes he was making.
</li>
<li>Although Alan was not a neophyte skier, there was still much he needed to learn.
</li>
<li>All neophyte swimmers will work on their techniques in the shallow end of the pool.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> <a href="https://wordsinasentence.com/nettle-in-a-sentence/">Nettle</a></h2>
<div class="outline-text-2" id="text-22">
<p>
<code>to cause someone to become annoyed or angry</code>
</p>

<ul class="org-ul">
<li>My brother will often nettle me by reading my diary.
</li>
<li>If you nettle a bee, you should be prepared to run.
</li>
<li>My employee’s habit of coming in to work late is starting to nettle me.
</li>
<li>Although Elaine tried to nettle me by describing her great date with my ex-boyfriend, I did not let her comments bother me.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> <a href="https://wordsinasentence.com/niggle-in-a-sentence/">Niggle</a></h2>
<div class="outline-text-2" id="text-23">
<p>
<code>to cause minor but continuous irritation or anxiety</code>
</p>

<ul class="org-ul">
<li>Something decided to niggle at me for the duration of the day, but even though it continued to bother me I couldn’t remember what it was.
</li>
<li>I had an ant bite that continued to niggle me throughout the day, but thankfully it was nothing more than a minor irritant.
</li>
<li>The high-pitched voice of the teacher never fails to niggle me, but I always tell myself that it could be worse.
</li>
<li>Something that is small and agitating will niggle you, but unless it really hurts you probably will be able to more or less ignore it.
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> <a href="https://wordsinasentence.com/nimble-in-a-sentence/">Nimble</a></h2>
<div class="outline-text-2" id="text-24">
<p>
<code>quick in action or comprehension</code>
</p>

<ul class="org-ul">
<li>The overweight police officer could not catch the nimble suspect.
</li>
<li>Even though Grandma Helen is in her nineties, she still has the nimble mind of a young woman.
</li>
<li>The nimble hamster enjoyed running on his wheel.
</li>
<li>Because Amy is not nimble in math, she often goes to school early to get extra help from the teacher.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> <a href="https://wordsinasentence.com/nominal-in-a-sentence/">Nominal</a></h2>
<div class="outline-text-2" id="text-25">
<p>
<code>incredibly small</code>
</p>

<ul class="org-ul">
<li>The court gave me a nominal award that did not cover the cost of my car repairs.
</li>
<li>Despite his immense wealth, Frank is a selfish man who gives a nominal amount to charities each year.
</li>
<li>Jim did not get a lot of job applicants because he offered only a nominal salary to his employees.
</li>
<li>Fortunately, I have a credit card with only a nominal interest rate.
</li>
<li>There is a nominal fee added to the ticket price of all 3D movies.
</li>
<li>With my coupons, my groceries cost me a nominal amount this week.
</li>
<li>I need only a nominal amount of gasoline to start my lawnmower.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> <a href="https://wordsinasentence.com/nostrum-in-a-sentence/">Nostrum</a></h2>
<div class="outline-text-2" id="text-26">
<p>
<code>a plan or remedy that is unlikely to work</code>
</p>

<ul class="org-ul">
<li>Although my sister is not a doctor, she thinks she can cure any illness and is quick to suggest a nostrum to her friends.
</li>
<li>Marie wanted to lose weight so badly she bought the diet nostrum even after reading the drug’s bad reviews.
</li>
<li>To get rid of an <b>unsightly</b> <b>rash</b>, Phil was even willing to try a nostrum recommended by his crazy uncle.
</li>
<li>Does garlic actually cure colds or is this remedy simply another nostrum?
</li>
</ul>
</div>
</div>
