ruby/N.org
* [[https://wordsinasentence.com/noxious-in-a-sentence/][Noxious]]

  =harmful=

  - Besides being annoying, the mosquito is a noxious insect that can carry and transmit a number of potentially fatal diseases.
  - When I made the mistake of asking my wife what that noxious smell was, it turned out to be dinner, which I ate with my happy face.
  - You can avoid getting sick so often by frequently washing your hands to eliminate noxious bacteria and viruses.
  - Although I am spending as much time as I can in my garden, I’m still having trouble keeping the noxious weeds from completely taking over.
  - Because Alan is a dedicated *couch potato*, he considers any form of exercise to be a noxious activity that is harmful to his health.
  - While Rhonda packed for her cruise, she was blissfully unaware of the noxious microbes that were attacking her immune system.
  - Even though many snakes are not the noxious type, a lot of people are terrified of anything that *slithers* or *hisses*.



* [[https://wordsinasentence.com/nugatory-in-a-sentence/][Nugatory]]

  =having no worth or value; useless=

  - Jim’s nugatory comments contributed nothing to the class discussion.
  - Because my stamp collection is nugatory in value, I am not losing anything by throwing it in the trash.
  - Buying the pass was nugatory since we still had to wait over an hour to get into the attraction.
  - Since Janice does not have a vehicle, she knows car insurance is a nugatory investment.



* [[https://wordsinasentence.com/numinous-in-a-sentence/][Numinous]]

  =displaying a holy or sacred characteristics=

  - After months of digging at the ancient burial site, an archaeologist uncovered a numinous artifact from the civilization’s ceremonial chamber.
  - Speaking in tongues and worshipping for many hours, the numinous stranger walked around town praying for anyone who asked.
  - Despite the Pope’s numinous appearance, his wealth and power over the citizens made him seem less righteous.
  - Conducted in a church, many hymns were sung and prayers were cited during the numinous wedding ceremony.



* [[https://wordsinasentence.com/numismatist-in-a-sentence/][Numismatist]]

  =a professional coin or medal collector=

  - To find out the true value of his coin collection, the man sought an accredited numismatist.
  - Gold coins and bars lined the collection vault of the proud numismatist.
  - A numismatist was hired by the museum to help with the gallery’s vast assortment of coins and medals.
  - The rare four dollar U.S. coin was verified as legitimate by a numismatist who was familiar with various coins.







#+HTML: <a id="bottom"/>
#+HTML: <a href="#top">⇧</a>