ruby/N.html



<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> <a href="https://wordsinasentence.com/noxious-in-a-sentence/">Noxious</a></h2>
<div class="outline-text-2" id="text-27">
<p>
<code>harmful</code>
</p>

<ul class="org-ul">
<li>Besides being annoying, the mosquito is a noxious insect that can carry and transmit a number of potentially fatal diseases.
</li>
<li>When I made the mistake of asking my wife what that noxious smell was, it turned out to be dinner, which I ate with my happy face.
</li>
<li>You can avoid getting sick so often by frequently washing your hands to eliminate noxious bacteria and viruses.
</li>
<li>Although I am spending as much time as I can in my garden, I’m still having trouble keeping the noxious weeds from completely taking over.
</li>
<li>Because Alan is a dedicated <b>couch potato</b>, he considers any form of exercise to be a noxious activity that is harmful to his health.
</li>
<li>While Rhonda packed for her cruise, she was blissfully unaware of the noxious microbes that were attacking her immune system.
</li>
<li>Even though many snakes are not the noxious type, a lot of people are terrified of anything that <b>slithers</b> or <b>hisses</b>.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> <a href="https://wordsinasentence.com/nugatory-in-a-sentence/">Nugatory</a></h2>
<div class="outline-text-2" id="text-28">
<p>
<code>having no worth or value; useless</code>
</p>

<ul class="org-ul">
<li>Jim’s nugatory comments contributed nothing to the class discussion.
</li>
<li>Because my stamp collection is nugatory in value, I am not losing anything by throwing it in the trash.
</li>
<li>Buying the pass was nugatory since we still had to wait over an hour to get into the attraction.
</li>
<li>Since Janice does not have a vehicle, she knows car insurance is a nugatory investment.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> <a href="https://wordsinasentence.com/numinous-in-a-sentence/">Numinous</a></h2>
<div class="outline-text-2" id="text-29">
<p>
<code>displaying a holy or sacred characteristics</code>
</p>

<ul class="org-ul">
<li>After months of digging at the ancient burial site, an archaeologist uncovered a numinous artifact from the civilization’s ceremonial chamber.
</li>
<li>Speaking in tongues and worshipping for many hours, the numinous stranger walked around town praying for anyone who asked.
</li>
<li>Despite the Pope’s numinous appearance, his wealth and power over the citizens made him seem less righteous.
</li>
<li>Conducted in a church, many hymns were sung and prayers were cited during the numinous wedding ceremony.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> <a href="https://wordsinasentence.com/numismatist-in-a-sentence/">Numismatist</a></h2>
<div class="outline-text-2" id="text-30">
<p>
<code>a professional coin or medal collector</code>
</p>

<ul class="org-ul">
<li>To find out the true value of his coin collection, the man sought an accredited numismatist.
</li>
<li>Gold coins and bars lined the collection vault of the proud numismatist.
</li>
<li>A numismatist was hired by the museum to help with the gallery’s vast assortment of coins and medals.
</li>
<li>The rare four dollar U.S. coin was verified as legitimate by a numismatist who was familiar with various coins.
</li>
</ul>







<a id="bottom"/>
<a href="#top">⇧</a>
</div>
</div>
</div>
</body>
</html>